Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Swift defines two kinds of initializers for class types to help ensure all stored properties receive an initial value.
ja: スウィフトは、クラス型のために２種類のイニシャライザを定義して、全ての格納プロパティが初期値を受け取ることを確実にするのを手伝います。

source: Swift enumeration cases don’t have an integer value set by default, unlike languages like C and Objective-C.
ja: スウィフト列挙は、CおよびObjective-Cのような言語と違い、初期状態で設定される整数値を持ちません。

source: Swift enumerations are particularly well suited to modeling a group of related error conditions, with associated values allowing for additional information about the nature of an error to be communicated.
ja: スウィフト列挙は、関連値がエラーの性質についての追加の情報と通信可能にすることを含め、関係のあるエラー状況のグループを作るのにとりわけ適します。

source: Swift exposes a collection of all the cases as an allCases property of the enumeration type.
ja: スウィフトは、ケース節すべてからなるコレクションを、列挙型のallCasesプロパティとして公開します。

source: Swift gives you a warning if you use an optional value where a value of type Any is expected.
ja: スウィフトは、あなたがオプショナル値を型Anyが期待されるところで使うならば警告を与えます。

source: Swift gives you the freedom to define your own custom infix, prefix, postfix, and assignment operators, with custom precedence and associativity values.
ja: スウィフトは、あなたに、特注の優先順位と結合性値で、あなた自身のあつらえの接中辞、接頭辞、接尾辞、そして代入演算子を定義する自由を与えます。

source: Swift handles all of the memory management of capturing for you.
ja: スウィフトは、キャプチャ（その瞬間の保存）の記憶管理の全てを、あなたのために取り扱います。

source: Swift handles the memory management of instances through automatic reference counting (ARC), as described in Automatic Reference Counting.
ja: スウィフトは、自動参照カウントで記述されるように、インスタンスのメモリ管理を自動参照カウント（ARC）を通して取り扱います。

source: Swift has a basic Boolean type, called Bool.
ja: スウィフトは、ひとつの基本的なブール型を持ちます、それはBoolと呼ばれるものです。

source: Swift has been years in the making, and it continues to evolve with new features and capabilities.
ja: スウィフトはその作成に幾年かを費やしています、そしてそれは新しい特徴と能力で発展し続けます。

source: Swift has built-in support for checking API availability, which ensures that you don’t accidentally use APIs that are unavailable on a given deployment target.
ja: スウィフトは、API有効性確認のための組み込みのサポートを持ちます、それはあなたが特定の開発対象で有効でないAPIをうっかり使うことがないのを確実にします。

source: Swift has five control transfer statements:
ja: スウィフトは、５つの制御移動文を持ちます：

source: Swift has five control transfer statements: a break statement, a continue statement, a fallthrough statement, a return statement, and a throw statement.
ja: スウィフトは、５つの制御移動文を持ちます：break文、continue文、fallthrough文、return文、そしてthrow文。

source: Swift has three branch statements: an if statement, a guard statement, and a switch statement.
ja: スウィフトは、３つの分岐文を持ちます：if文、guard文、そしてswitch文。

source: Swift has three compiler control statements: a conditional compilation block a line control statement, and a compile-time diagnostic statement.
ja: スウィフトは、３つのコンパイラ制御文：条件コンパイルブロック、行制御文、そしてコンパイル時診断文を持ちます。

source: Swift has three loop statements: a for-in statement, a while statement, and a repeat-while statement.
ja: スウィフトは、３つのループ文を持ちます：for-in文、while文、そしてrepeat-while文。

source: Swift helps to ensure your overrides are correct by checking that the override definition has a matching superclass definition.
ja: スウィフトは、あなたの無効化が正しいものであることを、その無効化定義がスーパークラス定義に合致するのを確認することによって確実にします。

source: Swift includes several range operators, which are shortcuts for expressing a range of values.
ja: スウィフトは、いくつかの範囲演算子を含みます、それらは値の範囲を表す近道です。

source: Swift is a type-safe language, which means the language helps you to be clear about the types of values your code can work with.
ja: スウィフトは型安全な言語です、それが意味するのは、この言語があなたを助けて、あなたのコードが扱うことができる値の型について明確であるようにすることです。

source: Swift is a type-safe language.
ja: スウィフトは、型安全な言語です。

source: Swift is a fantastic way to write software, whether it’s for phones, desktops, servers, or anything else that runs code.
ja: スウィフトはソフトウェアを記述する素晴らしい方法です、コードを実行するのが電話、デスクトップ、サーバー、または何か他のものであろうともです。

source: Swift is a new programming language for iOS, macOS, watchOS, and tvOS app development.
ja: スウィフトは、iOS、macOS、watchOS、そしてtvOSアプリ開発のための新しいプログラミング言語です。

source: Swift is a type-safe language, and doesn’t allow (for example) a variable of type String and a variable of type Double to swap values with each other.
ja: スウィフトは型安全な言語です、それで（例えば）型Stringの変数と型Doubleの変数にお互いに値を交換させることをしません。

source: Swift is friendly to new programmers.
ja: スウィフトは、新規プログラマーに好意的です。

source: Swift makes it easy to provide tailored implementations of these operators and to determine exactly what their behavior should be for each type you create.
ja: スウィフトは、それら演算子の注文仕立ての実装を提供することについて、そしてそれらの挙動があなたがつくる各型のために正確にどういったものでなければならないかについて決定することを簡単にします。

source: Swift marks redundant protocol conformances as an error.
ja: スウィフトは、冗長なプロトコル準拠をエラーであると印します。

source: Swift now has a Nil-Coalescing Operator (a ?? b), which unwraps an optional’s value if it exists, or returns a default value if the optional is nil.
ja: スウィフトは今やnil合体演算子（a ?? b）をもちます、それはあるオプショナルの値を、もしそれが存在するならばアンラップします、またはそのオプショナルがnilならばある省略時の値を返します。

source: Swift now has a native Set collection type.
ja: スウィフトは今では持って生まれたSetコレクション型を持ちます。

source: Swift now includes the as? and as! failable downcast operators.
ja: スウィフトは今では失敗できるダウンキャスト演算子as?とas!を含めます。

source: Swift picks which implementation of log() to call by consulting only the minimum requirements that Pair needs to conform to Loggable.
ja: スウィフトは、log()の実装のどれを呼び出すかの選択を、PairがLoggableに準拠するために必要とする最小限の要件のみを考慮することで行います。

source: Swift produces a warning if the default case matches any enumeration case that is known at compiler time.
ja: スウィフトは警告を生成します、もしそのdefaultケース節がコンパイル時に既知である何らかの列挙ケース節に合致するならば。

source: Swift provides a default initializer for any structure or class that provides default values for all of its properties and does not provide at least one initializer itself.
ja: スウィフトは、それのもつプロパティの全てに省略時の値を与えて、ともかく１つのイニシャライザもそれ自身では提供しないあらゆる構造体またはクラスのために、省略時のイニシャライザを用意します。

source: Swift provides a variety of control flow statements.
ja: スウィフトは、さまざまな制御の流れ文を提供します。

source: Swift provides an additional integer type, Int, which has the same size as the current platform’s native word size:
ja: スウィフトは追加の整数型、Intを提供します、そしてそれは、現在のプラットホーム固有のワードサイズと同じ大きさを持ちます：

source: Swift provides an elegant solution to this problem, known as a closure capture list.
ja: スウィフトはこの問題の洗練された解答、クロージャ捕獲リストとして知られるものを提供します。

source: Swift provides first-class support for throwing, catching, propagating, and manipulating recoverable errors at runtime.
ja: スウィフトは、回復可能なエラーのスロー、キャッチ、伝達、そして取り扱いに対してファーストクラスのサポートを提供します。

source: Swift provides five different access levels for entities within your code.
ja: スウィフトは、５つの異なるアクセス水準をあなたのコード内の実在に対して用意します。

source: Swift provides five levels of access control: open, public, internal, file private, and private.
ja: スウィフトは、５つの水準のアクセス制御を提供します：公開、内部、そして非公開。

source: Swift provides its own versions of all fundamental C and Objective-C types, including Int for integers, Double and Float for floating-point values, Bool for Boolean values, and String for textual data.
ja: スウィフトは、全ての基本的なCおよびObjective-C型に関してそれ自身のバージョンを提供します、それには、整数のためのInt、浮動小数点値のためのDoubleとFloat、ブール値のためのBool、そして、文字情報データのためのStringを含みます。

source: Swift provides several different ways to access Unicode representations of strings.
ja: スウィフトは、文字列のUnicode表現にアクセスするためにいくつかの異なる方法を提供します。

source: Swift provides signed and unsigned integers in 8, 16, 32, and 64 bit forms.
ja: スウィフトは、８、16、32、そして64ビット形式で、符号つきおよび符号なし整数を提供します。

source: Swift provides synthesized implementations for the following kinds of custom types:
ja: スウィフトは、合成された実装を以下の種類のあつらえの方に対して提供します：

source: Swift provides the following Interface Builder attributes: IBAction, IBSegueAction, IBOutlet, IBDesignable, and IBInspectable.
ja: スウィフトは、以下のインターフェイスビルダー属性を提供します：IBAction、IBSegueAction、IBOutlet、IBDesignable、そしてIBInspectable。

source: Swift provides three arithmetic overflow operators that opt in to the overflow behavior for integer calculations.
ja: スウィフトは、整数計算のためにオーバフロー挙動を選択する３つの算術オーバフロー演算子を提供します。

source: Swift provides three primary collection types, known as arrays, sets, and dictionaries, for storing collections of values.
ja: スウィフトは３つの主要なコレクション型を提供します、それらは配列、集合、そして辞書として知られ、値の集まり（コレクション）をしまっておくためのものです。

source: Swift provides three ways to compare textual values: string and character equality, prefix equality, and suffix equality.
ja: スウィフトは、テキスト関連の値を比較する３つの方法を提供します：文字列および文字の等式、接頭辞等式、そして接尾辞等式。

source: Swift provides two Boolean constant values, true and false:
ja: スウィフトは２つのブールの定数値、trueとfalseを提供します：

source: Swift provides two forms of syntactic sugar for initialization of a property wrapper.
ja: スウィフトは、２つの形式の糖衣構文をプロパティラッパーの初期化に対して提供します。

source: Swift provides two kinds of while loops:
ja: スウィフトは２種類のwhileループを提供します：

source: Swift provides two signed floating-point number types:
ja: スウィフトは、２つの符号つき浮動小数点数型を提供します：

source: Swift provides two special types for working with nonspecific types:
ja: スウィフトは、２つの特別な型を「不特定」の型を扱うために提供します：

source: Swift provides two ways to add conditional branches to your code: the if statement and the switch statement.
ja: スウィフトは条件分岐をあなたのコードに加える２つの方法：if文とswitch文を提供します。

source: Swift provides two ways to resolve strong reference cycles when you work with properties of class type: weak references and unowned references.
ja: あなたがクラス型のプロパティを扱うとき、スウィフトは強い参照循環を解消する２つの道を提供します：弱い参照と非所有参照。

source: Swift reports an error at compile time if you try to use an API that isn’t available.
ja: スウィフトは、あなたが有効でないAPIを使おうと試みるならば、コンパイル時にエラーを報告します。

source: Swift requires you to write self.someProperty or self.someMethod() (rather than just someProperty or someMethod()) whenever you refer to a member of self within a closure.
ja: スウィフトはあなたにself.somePropertyまたはself.someMethod()（ただ単にsomePropertyまたはsomeMethod()ではなく）を書くことを、あなたがクロージャ内でselfのメンバーに言及するときはいつでも、要求します。

source: Swift strings are represented by the String type.
ja: スウィフトの文字列はString型によって表されます。

source: Swift supports all of the bitwise operators found in C, as described below.
ja: スウィフトは、下記のように、Cで見つけられるビット単位演算子の全てをサポートします。

source: Swift supports all standard C comparison operators:
ja: スウィフトは、標準的なC 比較演算子の全てをサポートします：

source: Swift supports most standard C operators and improves several capabilities to eliminate common coding errors.
ja: スウィフトは、ほとんどの標準のC演算子をサポートして、一般的なコード記述エラーを排除するためにいくつかの能力を向上させます。

source: Swift supports the four standard arithmetic operators for all number types:
ja: スウィフトは、４つの標準の算術演算子を数の型すべてに対してサポートします：

source: Swift supports the three standard logical operators found in C-based languages:
ja: スウィフトは、Cに基づく言語で見られる３つの標準の論理演算子をサポートします：

source: Swift treats the assignment like a wrappedValue argument and uses the initializer that accepts the arguments you include.
ja: スウィフトは、その代入をwrappedValue引数のように扱います、そしてあなたが含める引数を受け入れるイニシャライザを使います。

source: Swift unifies these concepts into a single property declaration.
ja: スウィフトは、これらの概念をだだ１つのプロパティ宣言に統一します。

source: Swift uses Automatic Reference Counting (ARC) to track and manage your app’s memory usage.
ja: スウィフトは、あなたのアプリのメモリ使用を追跡して管理するために、自動参照カウント（ARC）を使います。

source: Swift uses capture lists to break these strong reference cycles.
ja: スウィフトは、これらの強い参照循環を壊すために捕獲リストを使用します。

source: Swift uses string interpolation to include the name of a constant or variable as a placeholder in a longer string, and to prompt Swift to replace it with the current value of that constant or variable.
ja: スウィフトは、定数または変数の名前をより長い文字列の中にプレースホルダーとして含めるために、そしてそれをその定数または変数の現在の値と取り替えることをスウィフトに促すために、文字列補間を使います。

source: Swift uses type inference extensively, allowing you to omit the type or part of the type of many variables and expressions in your code.
ja: スウィフトは広く型推論を使います、そして、あなたのコードにおいて多くの変数および式の型または型の一部をあなたが省略できるようにします。

source: Swift’s Array type already provides an append(_:) method, a count property, and a subscript with an Int index to retrieve its elements.
ja: スウィフトのArray型は、すでにappend(_:)メソッド、countプロパティ、そしてその要素を取り出すためにIntインデックスを使う添え字を提供します。

source: Swift’s Array type also provides an initializer for creating an array of a certain size with all of its values set to the same default value.
ja: スウィフトのArray型はまた、その値の全てが提供された同じ初期値に設定される、特定の大きさの配列をつくるためにイニシャライザを提供します。

source: Swift’s Array type is bridged to Foundation’s NSArray class.
ja: スウィフトのArray型はFoundationのNSArrayクラスにブリッジ（橋渡し）されます。

source: Swift’s Array type now has full value semantics.
ja: スウィフトのArray型は現在は完全な値意味論を持ちます。

source: Swift’s Dictionary type does not have a defined ordering.
ja: スウィフトのDictionary型は、決まった順序を持ちません。

source: Swift’s Dictionary type implements its key-value subscripting as a subscript that takes and returns an optional type.
ja: スウィフトのDictionary型は、それの「キーと値」に関する添え字を、オプショナル型を受け取り返す添え字として実装します。

source: Swift’s Dictionary type is bridged to Foundation’s NSDictionary class.
ja: スウィフトのDictionary型は、FoundationのNSDictionaryクラスにブリッジ（橋渡し）します。

source: Swift’s Int type has an initializer which tries to convert a String value into an Int value.
ja: スウィフトのInt型はあるイニシャライザを持ちます、それはString値をInt値に変換することを試みます。

source: Swift’s Set type does not have a defined ordering.
ja: スウィフトのSet型は、決まった順番を持ちません。

source: Swift’s Set type is bridged to Foundation’s NSSet class.
ja: スウィフトのSet型は、FoundationのNSSetクラスにブリッジ（橋渡し）されます。

source: Swift’s String and Character types provide a fast, Unicode-compliant way to work with text in your code.
ja: スウィフトのStringおよびCharacter型は、あなたのコードにおいてテキストを処理するために、ある高速な、Unicodeに対応したやり方を提供します。

source: Swift’s String type is a value type.
ja: スウィフトのString型は、値型です。

source: Swift’s String type is bridged with Foundation’s NSString class.
ja: スウィフトのString型は、FoundationのNSStringクラスを使って橋渡しをされます。

source: Swift’s nil isn’t the same as nil in Objective-C.
ja: スウィフトのnilは、Objective-Cでのnilと同じものではありません。

source: Swift’s switch statement is considerably more powerful than its counterpart in many C-like languages.
ja: スウィフトのswitch文は、多くのCに似た言語において相当する物よりずっと強力です。

source: Swift’s String and Character types are fully Unicode-compliant, as described in this section.
ja: スウィフトのStringとCharacter型は、この節で記述されるように、完全にUnicodeに対応しています。

source: Swift’s String type defines its string-specific implementation of the greater-than operator (>) as a method that has two parameters of type String, and returns a value of type Bool.
ja: スウィフトのString型は、それの文字列特有の実装の「大なり」演算子（>）をメソッドとして定義します、それは型Stringの２つのパラメータを持ち、型Boolの値を返します。

source: Swift’s access control model is based on the concept of modules and source files.
ja: スウィフトのアクセス制御モデルは、モジュールとソースファイルの概念に基づきます。

source: Swift’s approach prevents a situation in which a simple initializer from a superclass is inherited by a more specialized subclass and is used to create a new instance of the subclass that is not fully or correctly initialized.
ja: スウィフトの取り組み方は、スーパークラスのもつ単純なイニシャライザがより特殊化されたサブクラスによって継承されて、充分にまたは正しく初期化されない状態の、サブクラスの新しいインスタンスをつくるのに使われる状況を防ぎます。

source: Swift’s array, set, and dictionary types are implemented as generic collections.
ja: スウィフトの配列、集合、そして辞書型は、総称体のコレクションとして実装されます。

source: Swift’s closure expressions have a clean, clear style, with optimizations that encourage brief, clutter-free syntax in common scenarios.
ja: スウィフトのクロージャ式は、最適化された、きれいな、明白なスタイルを持ちます、それは、通常さまざまに予想される状況において、簡潔な、混乱のない構文を助長します。

source: Swift’s compiler performs four helpful safety-checks to make sure that two-phase initialization is completed without error:
ja: スウィフトのコンパイラは、２段階初期化がエラーなしで完了されることを確認するために４つの役に立つ安全点検を実行します：

source: Swift’s copy-by-default String behavior ensures that when a function or method passes you a String value, it’s clear that you own that exact String value, regardless of where it came from.
ja: スウィフトの省略時コピーのString挙動は、関数またはメソッドがあなたにString値を渡すとき、それが来たところに関係なく、あなたがその正確な写しのString値を所有することが明白なのを確実にします。

source: Swift’s initialization flow is more flexible in that it lets you set custom initial values, and can cope with types for which 0 or nil is not a valid default value.
ja: それがあなたに好みに合わせた初期値を設定させて、0またはnilが有効な省略時の値でない型に対処することができるという点で、スウィフトの初期化の流れはより柔軟です。

source: Swift’s native String type no longer has an uppercaseString or lowercaseString property.
ja: スウィフトの生粋のString型はもはやuppercaseStringまたはlowercaseStringプロパティを持ちません。

source: Swift’s operator precedences and associativity rules are simpler and more predictable than those found in C and Objective-C.
ja: スウィフトの演算子優先順位と結合性規則は、CとObjective-Cで見つけられるそれらより単純でより予測できます。

source: Swift’s optionals let you indicate the absence of a value for any type at all, without the need for special constants.
ja: スウィフトのオプショナルは、あなたに特別な定数の必要なしにあらゆる全ての型の値の欠如を示させます。

source: Swift’s standard library provides a method called sorted(by:), which sorts an array of values of a known type, based on the output of a sorting closure that you provide.
ja: スウィフトの標準ライブラリはsorted(by:)と呼ばれるメソッドを提供します、それは、ある既知の型の値からなる配列の分類を、あなたが提供するあるソート（分類）を行うクロージャの出力に基づき行います。

source: Swift’s two-phase initialization process is similar to initialization in Objective-C.
ja: スウィフトの２段階初期化プロセスは、Objective-Cでの初期化に似ています。

source: Swift’s type checker is able to deduce that Movie and Song have a common superclass of MediaItem, and so it infers a type of [MediaItem] for the library array:
ja: スウィフトの型チェッカーはMovieとSongが共通のスーパークラスMediaItemを持つと推論することができます、なのでそれはlibrary配列に対して[MediaItem]型を推論します：

source: Swift’s type safety prevents non-Boolean values from being substituted for Bool.
ja: スウィフトの型安全は、非ブール値がBoolの代用にされるのを妨げます。

source: Swift’s unified function syntax is flexible enough to express anything from a simple C-style function with no parameter names to a complex Objective-C-style method with names and argument labels for each parameter.
ja: スウィフトの統合された関数構文は、十分な柔軟性があり、パラメータ名を持たない単純なCスタイルの関数から、各パラメータに対して名前および引数ラベルをもつ複雑なObjective-Cスタイルのメソッドまで、何でも表わします。

source: Switch
ja: スイッチ

source: Switch Case Attributes
ja: スイッチケース節属性

source: Switch Statement
ja: スイッチ文

source: Switch Statements Must Be Exhaustive
ja: スイッチ文は徹底的でなければなりません

source: Switches support any kind of data and a wide variety of comparison operations—they aren’t limited to integers and tests for equality.
ja: スイッチ（条件分岐）は、あらゆる種類のデータおよび多種多様な比較操作をサポートします ― それは、整数および同等性に対する検査に限られていません。

source: Switching Over Future Enumeration Cases
ja: 未来列挙ケース節に対してスイッチする

source: Switching over a nonfrozen enumeration requires extra consideration.
ja: 非凍結列挙に対してスイッチすることは、余分な考慮を必要とします。

source: Syntactic categories are indicated by italic text and appear on both sides of a grammar production rule.
ja: 統語論のカテゴリーは、イタリックのテキストによって示されて、文法導出規則の両側に現れます。

source: Syntactically, a variadic parameter consists of a base type name followed immediately by three dots (...), as in Int....
ja: 統語的には、可変長パラメータは、Int...のように、基となる型名に直ちに３つの点（...）が続くものから成ります。

source: Syntactically, every primary expression is also a postfix expression.
ja: 統語論的に、あらゆる基本式は、また、接尾辞式です。

source: Syntax for Designated and Convenience Initializers
ja: 指定および便宜イニシャライザのための構文

source: Taken together, these constraints mean that the value passed for the indices parameter is a sequence of integers.
ja: 総合すると、これらの制約が意味するのは、indicesパラメータに対して渡される値は整数からなるシーケンスであるということです。

source: Terminology
ja: 用語

source: Ternary Conditional Operator
ja: 三項条件演算子

source: Thanks to Swift’s type inference, you don’t actually need to declare a concrete Item of Int as part of the definition of IntStack.
ja: スウィフトの型推論のおかげで、あなたは実際にはIntである具体的なItemをIntStackの定義の一部として宣言する必要がありません。

source: Thanks to Swift’s type inference, you don’t have to write the type of the array if you’re initializing it with an array literal containing values of the same type.
ja: スウィフトの型推論のおかげで、あなたが同じ型の値を含んでいる配列リテラルでそれを初期化しているのならば、あなたは配列の型を書く必要はありません。

source: That branch must transfer control to exit the code block in which the guard statement appears.
ja: その分岐は、制御を移して、guard文が現れているコードブロックを脱出する必要があります。

source: That function’s caller can then catch the error and respond appropriately.
ja: その関数の呼び出し側はそのときそのエラーをキャッチして（捕まえて）適切に応答することができます。

source: That is, an implementation of == must satisfy the following three conditions, for all values a, b, and c:
ja: すなわち、==の実装は、以下の３つの条件をa、b、およびcすべての値に対して満足させなければなりません。

source: That is, every possible value of the type being considered must be matched by one of the switch cases.
ja: すなわち、考察されている型のすべてのあり得る値が、switchケース節のうちの１つと適合しなければなりません。

source: That is, it must provide a way to make itself uniquely representable.
ja: すなわち、それはそれ自身を特有に表わすことを可能にする方法を提供しなければなりません。

source: That is, the code in the first defer statement executes last, the code in the second defer statement executes second to last, and so on.
ja: すなわち、最初のdefer文のコードが最後に実行され、２番目のdefer文のコードが最後から２番目に実行され、等々。

source: That is, the entire switch statement completes its execution as soon as the first matching case is completed.
ja: すなわち、最初の適合するケース節が完了されるとすぐに、switch文の全体がその実行を完了します。

source: That is, the type must conform to one of the following Swift standard library protocols: ExpressibleByIntegerLiteral for integer literals, ExpressibleByFloatLiteral for floating-point literals, ExpressibleByStringLiteral for string literals, ExpressibleByBooleanLiteral for Boolean literals, ExpressibleByUnicodeScalarLiteral for string literals that contain only a single Unicode scalar, and ExpressibleByExtendedGraphemeClusterLiteral for string literals that contain only a single extended grapheme cluster.
ja: すなわち、その型は以下のスウィフト標準ライブラリのプロトコルの１つに準拠しなければなりません：整数リテラルに対してExpressibleByIntegerLiteral、浮動小数点リテラルに対してExpressibleByFloatLiteral、文字列リテラルに対してExpressibleByStringLiteral、ブールのリテラルに対してExpressibleByBooleanLiteral、ただ１つのユニコードスカラーだけを含む文字列リテラルに対してExpressibleByUnicodeScalarLiteral、そしてただ１つの拡張書記素クラスタだけを含む文字列リテラルに対してExpressibleByExtendedGraphemeClusterLiteral。

source: That is, the type of x in var x: Int = 0 is inferred by first checking the type of 0 and then passing this type information up to the root (the variable x).
ja: すなわち、var x: Int = 0の中のxの型は、最初に0の型を調べて、それからこの型情報を根（変数x）までさかのぼって渡すことによって推論されます。

source: That means it can’t use any methods or properties that are defined by the underlying type of the generator.
ja: それは意味するのは、それが生成子の基礎をなす型によって定義されるどんなメソッドまたはプロパティも使用できないということです。

source: That said, a nonthrowing method can override a throwing method, and a nonthrowing method can satisfy a protocol requirement for a throwing method.
ja: とは言え、非スローメソッドはスローメソッドをオーバーライドできます、そして非スローメソッドはスローメソッドのプロトコル要件を満たすことができます。

source: That said, a rethrowing method can override a throwing method, and a rethrowing method can satisfy a protocol requirement for a throwing method.
ja: とは言え、再スローメソッドはスローメソッドをオーバーライドできます、そして再スローメソッドはスローメソッド用のプロトコル要件を満たすことができます。

source: That said, because protocols don’t implement their members, most protocol members are declarations only.
ja: とは言え、プロトコルがそれらのメンバーを実装しないので、大部分のプロトコル・メンバーは宣言だけです。

source: That said, if a constant is initialized with a class object, the object itself can change, but the binding between the constant name and the object it refers to can’t.
ja: そうは言っても、定数がクラスオブジェクトで初期化されるならば、そのオブジェクト自体は変わることができます、しかし、定数名とそれが言及するオブジェクトの間の束縛はそうすることができません。

source: That said, if a subclass initializes all of its stored properties with default values and doesn’t define any initializers of its own, it inherits all of the superclass’s initializers.
ja: とは言え、サブクラスがそれの格納プロパティのすべてを省略時の値で初期化して、それ自身のイニシャライザを全く定義しないならば、それはそのスーパークラスのイニシャライザのすべてを継承します。

source: That said, if no initializer expression is present, the variable declaration must include an explicit type annotation (: type).
ja: とは言え、イニシャライザ式が存在しないならば、変数の宣言は明確な型注釈（: type）を含まなければなりません。

source: That said, if the type you’re extending is defined in another module, an initializer declaration must delegate to an initializer already defined in that module to ensure members of that type are properly initialized.
ja: とは言え、 あなたが拡張している型が別のモジュールにおいて定義されるならば、イニシャライザ宣言はそのモジュールですでに定義されるイニシャライザに委任して、その型のメンバーが正しく初期化されることを確実にしなければなりません。

source: That said, if you assign a value to a variable or property within its own didSet observer clause, that new value that you assign will replace the one that was just set and passed to the willSet observer.
ja: とは言え、あなたがdidSetオブザーバー節自身の内部である値を変数またはプロパティに代入するならば、あなたが代入するその新しい値は、ちょうど設定されたばかりのwillSetオブザーバーに渡されたものを置き換えることになります。
